Repository: Vita0818/Translatis
Catalog: Apps/SharedResources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: · %lld running
zh_hans: · %lld 个运行中

source: "%@" and its Translatis event history and artifacts will be permanently deleted. Files in the linked workspace will not be changed.
zh_hans: “%@”及其 Translatis 事件历史和产物将被永久删除。已关联工作区中的文件不会被更改。

source: "%@" and its %@ event history and artifacts will be permanently deleted. Files in the linked workspace will not be changed.
zh_hans: “%@”及其 %@ 事件历史和产物将被永久删除。已关联工作区中的文件不会被更改。

source: (image unavailable)
zh_hans: （图像不可用）

source: (image)
zh_hans: （图像）

source: (transcript)
zh_hans: （转写文本）

source: @%@ attached.
zh_hans: 已附加 @%@。

source: @%@ conflicts with an attached agent name.
zh_hans: @%@ 与已附加的 Agent 名称冲突。

source: @%@ could not be removed; it may still have active tasks.
zh_hans: 无法移除 @%@；它可能仍有活跃任务。

source: @%@ exact inference profile revision is unavailable or incompatible.
zh_hans: @%@ 的精确推理配置修订版本不可用或不兼容。

source: @%@ has an unresolved inference profile. Rebind it before resuming Cowork.
zh_hans: @%@ 的推理配置尚未解析。继续 Cowork 前请先重新绑定。

source: @%@ has no resolved inference profile for the control plane.
zh_hans: @%@ 没有可供控制面使用的已解析推理配置。

source: @%@ inference not attached
zh_hans: @%@ 的推理配置未附加

source: @%@ inference unavailable
zh_hans: @%@ 的推理配置不可用

source: @%@ is already attached.
zh_hans: @%@ 已经附加。

source: @%@ is detached, but its unreferenced workspace capability was retained because cleanup failed: %@
zh_hans: @%@ 已分离，但清理失败，因此其未引用的工作区能力仍被保留：%@

source: @%@ is not a valid agent name. Use ASCII letters, digits, '-' or '_'.
zh_hans: @%@ 不是有效的 Agent 名称。请使用 ASCII 字母、数字、“-”或“_”。

source: @%@ is reserved.
zh_hans: @%@ 是保留名称。

source: @%@ needs an explicit, resolvable inference profile rebind before Cowork can run.
zh_hans: 运行 Cowork 前，必须为 @%@ 显式重新绑定可解析的推理配置。

source: @%@ was attached, but its project settings could not be saved; remove it or retry settings before continuing.
zh_hans: @%@ 已附加，但无法保存其项目设置；继续前请将其移除或重试保存设置。

source: @main must be attached before selecting its next model
zh_hans: 必须先附加 @main，才能选择它下一次使用的模型

source: %@ · %lld completed
zh_hans: %@ · 已完成 %lld 项

source: %@ · %lld queued
zh_hans: %@ · %lld 项排队中

# %@ · %llu bytes
source: %1$@ · %2$llu bytes
zh_hans: %1$@ · %2$llu 字节

source: %@ · no budget
zh_hans: %@ · 无预算

source: %@ (%@ in / %@ out)
zh_hans: %@（输入 %@ / 输出 %@）

source: %@ (%@ input + %@ cached / %@ output)
zh_hans: %@（输入 %@ + 缓存 %@ / 输出 %@）

source: %@ approved
zh_hans: 已允许 %@

source: %@ cached
zh_hans: 缓存 %@

source: %@ call declined
zh_hans: 已拒绝 %@ 调用

source: %@ call denied by policy
zh_hans: 策略已拒绝 %@ 调用

source: %@ denied
zh_hans: 已拒绝 %@

source: %@ in
zh_hans: 输入 %@

source: %@ input
zh_hans: 输入 %@

source: %@ out
zh_hans: 输出 %@

source: %@ runtime failed
zh_hans: %@ 运行失败

source: %@ tok
zh_hans: %@ Token

source: %@ uses an external %@ credential reference; verify or enter the credential on iOS.
zh_hans: %@ 使用外部 %@ 凭据引用；请在 iOS 上验证或重新输入凭据。

source: %@ uses unsupported provider adapter %@; requests remain blocked until a supported OpenAI-compatible adapter is selected.
zh_hans: %@ 使用不受支持的提供商适配器 %@；改用受支持的 OpenAI 兼容适配器前，请求将保持阻止状态。

source: %@ was skipped because it has no OpenAI-compatible Base URL for iOS Chat.
zh_hans: %@ 未提供 iOS Chat 可用的 OpenAI 兼容 Base URL，因此已跳过。

source: %1$@ will be disabled and its current immutable revision tombstoned. %2$lld live connection authorities will be drained, and %3$lld Code/Cowork sessions currently reference this revision. Those sessions retain secret-free history and must detach or attach another tested revision before reconnecting.
zh_hans: %1$@ 将被停用，其当前不可变修订也会被封存。系统将排空 %2$lld 个实时连接权限；目前有 %3$lld 个 Code/Cowork 会话引用此修订。这些会话会保留不含密钥的历史记录，并且必须先分离或挂接另一个已测试的修订才能重新连接。

source: %@ will be disabled and its current immutable revision tombstoned. Existing session authority and audit history are retained.
zh_hans: %@ 将被停用，其当前不可变修订将被标记为已删除。现有会话权限与审计历史会保留。

# %lld of %lld
source: %1$lld of %2$lld
zh_hans: 第 %1$lld/%2$lld 题

source: %lld / %lld complete
zh_hans: 已完成 %lld / %lld 项

source: %lld / %lld requirements proven
zh_hans: 已验证 %lld / %lld 项要求

source: %lld active
zh_hans: %lld 项活跃

source: %lld agents · %lld running
zh_hans: %lld 个 Agent · %lld 个运行中

source: %lld attached
zh_hans: %lld 个已附加

source: %lld attachment
zh_hans: %lld 个附件

source: %lld attachments
zh_hans: %lld 个附件

source: %lld capabilities
zh_hans: %lld 项能力

source: %lld capability lease
zh_hans: %lld 个能力租约

source: %lld compatibility warnings require review.
zh_hans: 有 %lld 项兼容性警告需要检查。

source: %lld events
zh_hans: %lld 个事件

source: %lld live
zh_hans: %lld 个实时连接

source: %lld MCP
zh_hans: %lld 个 MCP

source: %lld models
zh_hans: %lld 个模型

source: %lld models · %@ · %@
zh_hans: %lld 个模型 · %@ · %@

source: %lld more MCP requests waiting
zh_hans: 另有 %lld 个 MCP 请求正在等待

source: %lld tasks
zh_hans: %lld 个任务

source: %lld tasks / %lld messages
zh_hans: %lld 个任务 / %lld 条消息

# %lld untrusted MCP context item%@ will be attached to the next message only.
source: %1$lld untrusted MCP context item%2$@ will be attached to the next message only.
zh_hans: %1$lld 项不受信任的 MCP 上下文%2$@将仅附加到下一条消息。

source: %lld untrusted MCP context items will be attached to the next message only.
zh_hans: %lld 项不受信任的 MCP 上下文将仅附加到下一条消息。

source: %lld workspace lease
zh_hans: %lld 个工作区租约

source: %llds %@
zh_hans: %lld 秒 %@

source: %llu bounded metric events · observed %@
zh_hans: %llu 个有界指标事件 · 观测于 %@

source: 1 event
zh_hans: 1 个事件

source: 1 model
zh_hans: 1 个模型

source: 1 model · %@ · %@
zh_hans: 1 个模型 · %@ · %@

source: 1 untrusted MCP context item will be attached to the next message only.
zh_hans: 1 项不受信任的 MCP 上下文将仅附加到下一条消息。

source: A Goal objective is required.
zh_hans: 必须填写 Goal 目标。

source: Absence of an exact grant is denial. New workers start with zero MCP access. The permission reviewer always has zero access and cannot be targeted. Child access is the intersection of the selected template, parent ancestry, live CapabilityLease ceiling, attachment policy, and server filter.
zh_hans: 没有精确授权即表示拒绝。新 worker 初始没有 MCP 访问权限。权限审查者始终没有访问权限且不可作为目标。子 Agent 的访问权限取所选模板、父级继承链、实时 CapabilityLease 上限、挂载策略和服务器过滤器的交集。

source: Absolute file path
zh_hans: 绝对文件路径

source: Access
zh_hans: 访问权限

source: Access template
zh_hans: 访问模板

source: Account
zh_hans: 账户

source: Account reference
zh_hans: 账户引用

source: Action Failed
zh_hans: 操作失败

source: active
zh_hans: 活跃

source: Active
zh_hans: 活跃

source: Active model
zh_hans: 当前模型

source: Active provider
zh_hans: 当前提供商

source: Active workload: %@
zh_hans: 活动工作负载：%@

source: Activity
zh_hans: 活动

source: Collaboration
zh_hans: 协作

source: Command
zh_hans: 命令

source: File changes
zh_hans: 文件更改

source: Image
zh_hans: 图像

source: MCP tool
zh_hans: MCP 工具

source: Approval review
zh_hans: 授权审查

source: Reconnecting
zh_hans: 正在重新连接

# Retrying request %lld of %lld
source: Retrying request %1$lld of %2$lld
zh_hans: 正在进行第 %1$lld/%2$lld 次重试

source: The Codex submission is missing its durable identity.
zh_hans: Codex 提交缺少持久化标识。

source: The Codex turn ended, but its retry state could not be persisted: %@
zh_hans: Codex 回合已结束，但无法持久化其重试状态：%@

source: The Codex turn finished, but completion could not be persisted: %@
zh_hans: Codex 回合已完成，但无法持久化完成状态：%@

source: The failed Codex submission has no exact model binding to continue.
zh_hans: 失败的 Codex 提交缺少可继续使用的精确模型绑定。

source: This failed turn is no longer retryable.
zh_hans: 该失败回合已无法重试。

source: Context compaction
zh_hans: 上下文压缩

source: Waiting
zh_hans: 等待

source: Runtime activity
zh_hans: 运行时活动

source: Subagent
zh_hans: 子代理

source: Web search
zh_hans: 网页搜索

source: Working
zh_hans: 正在处理

source: Add a provider to configure models.
zh_hans: 添加提供商以配置模型。

source: Add an agent before sending a Cowork message.
zh_hans: 发送 Cowork 消息前请先添加 Agent。

source: Add Directory
zh_hans: 添加目录

source: Add env_vars SecretRef
zh_hans: 添加 env_vars SecretRef

source: Add exact tool approval override
zh_hans: 添加精确工具审批覆盖

source: Add launch file
zh_hans: 添加启动文件

source: Add launch-closure file
zh_hans: 添加启动闭包文件

source: Add MCP Server
zh_hans: 添加 MCP 服务器

source: Add model
zh_hans: 添加模型

source: Add Model
zh_hans: 添加模型

source: Add only the required arguments and environment entries; store sensitive values as Keychain references.
zh_hans: 仅添加必需的参数和环境项；敏感值应保存为钥匙串引用。

source: Add or explicitly import a server configuration. Every draft is tested before its immutable revision is saved.
zh_hans: 添加或显式导入服务器配置。每份草稿都必须先通过测试，才能保存为不可变修订。

source: Add Project
zh_hans: 添加项目

source: Add provider
zh_hans: 添加提供商

source: Add Provider
zh_hans: 添加提供商

source: Add Server
zh_hans: 添加服务器

source: Add the exact executable and launch closure, then run translatis mcp test before attaching it.
zh_hans: 添加精确的可执行文件和启动闭包，然后在挂载前运行 translatis mcp test。

source: Add value
zh_hans: 添加值

source: Advanced settings
zh_hans: 高级设置

source: Agent Access
zh_hans: Agent 访问权限

source: Agent inference profiles
zh_hans: Agent 推理配置

source: Agent MCP Access
zh_hans: Agent MCP 访问权限

source: Agent names cannot contain spaces.
zh_hans: Agent 名称不能包含空格。

source: Agents
zh_hans: Agent

source: Agents, tasks, and workspace status
zh_hans: Agent、任务和工作区状态

source: Alias
zh_hans: 别名

source: Allow All Exact Connections
zh_hans: 允许所有精确连接

source: Allow Call Once
zh_hans: 仅允许本次调用

source: Allow Exact Connection
zh_hans: 允许精确连接

source: Allow Exact MCP Connections?
zh_hans: 允许这些精确 MCP 连接？

source: Allow insecure loopback HTTP for development
zh_hans: 允许用于开发的不安全回环 HTTP

source: Allow lists narrow a namespace when non-empty; deny lists always win. Session attachment and Agent grant filters can only narrow these server limits further.
zh_hans: 非空允许列表会收窄命名空间；拒绝列表始终优先。会话挂载和 Agent 授权过滤器只能进一步收窄这些服务器限制。

source: Allow parallel calls
zh_hans: 允许并行调用

source: Allow, one exact name per line
zh_hans: 允许列表，每行一个精确名称

source: Ambiguous @%@: %@
zh_hans: @%@ 指向不明确：%@

source: API key
zh_hans: API 密钥

source: Applying your decision.
zh_hans: 正在应用你的决定。

source: Approval
zh_hans: 审批

source: Approval ceiling
zh_hans: 审批上限

source: Approval: %@
zh_hans: 审批：%@

source: Approve
zh_hans: 批准

source: Approve Call
zh_hans: 允许调用

source: Approved.
zh_hans: 已允许。

source: Arguments
zh_hans: 参数

source: Arguments, one per line
zh_hans: 参数，每行一个

source: Artifact progress
zh_hans: 产物进度

source: Artifacts
zh_hans: 产物

source: assigned
zh_hans: 已分配

source: Assigned
zh_hans: 已分配

source: Assistant
zh_hans: 助手

source: Attach
zh_hans: 附加

source: Attach a server and grant this Agent resource access.
zh_hans: 挂载服务器并向此 Agent 授予资源访问权限。

source: Attach a standard-extended server and grant this Agent prompt access.
zh_hans: 挂载 standard-extended 服务器并向此 Agent 授予提示词访问权限。

source: Attach a workspace to inspect git state.
zh_hans: 附加工作区以检查 Git 状态。

source: Attach files
zh_hans: 附加文件

source: Attach MCP Server
zh_hans: 挂载 MCP 服务器

source: Attach records the current immutable server revision in the Session EventLog. It does not connect and it grants no Agent access.
zh_hans: 挂载会把当前不可变服务器修订记录到会话 EventLog 中。它不会建立连接，也不会授予任何 Agent 访问权限。

source: Attach Server
zh_hans: 挂载服务器

source: Attached Servers
zh_hans: 已挂载的服务器

source: Attaching @%@…
zh_hans: 正在附加 @%@…

source: Attaching records session authority only. It does not connect until an explicit Connect, Send, Resume, or Retry action.
zh_hans: 挂载只记录会话权限。只有显式执行“连接”“发送”“继续”或“重试”后才会建立连接。

source: Attachment
zh_hans: 挂载

source: Attachment %@ could not be preserved: %@
zh_hans: 无法保留附件 %@：%@

source: Attachment Policy
zh_hans: 挂载策略

source: Attachments and chat tools
zh_hans: 附件与对话功能

source: Attachments could not be selected: %@
zh_hans: 无法选择附件：%@

source: auth file
zh_hans: 认证文件

source: Authority fingerprint
zh_hans: 权限指纹

source: Authorization origin
zh_hans: 授权源

source: Authorized Roots
zh_hans: 已授权根目录

source: Auto
zh_hans: 自动

source: Automatic review failed
zh_hans: 自动审查失败

source: Automatic review in progress…
zh_hans: 正在自动审查…

source: Automatic review is disabled; ordinary submissions remain available, but ask-class tools fail closed.
zh_hans: 自动审查已停用；普通提交仍可使用，但 ask 类工具会默认拒绝。

source: Automatic review is still starting; ordinary submissions remain available.
zh_hans: 自动审查仍在启动；普通提交仍可使用。

source: Automatic review is unavailable (%@); ordinary submissions remain available, but ask-class tools fail closed.
zh_hans: 自动审查不可用（%@）；普通提交仍可使用，但 ask 类工具会默认拒绝。

source: Automatic review timed out
zh_hans: 自动审查超时

source: Automatic review unexpectedly left the automatic path; ask-class tools fail closed until it recovers.
zh_hans: 自动审查意外退出自动路径；恢复前 ask 类工具会默认拒绝。

source: autopilot
zh_hans: 自动模式

source: Base URL
zh_hans: 基础 URL

source: Bearer authorization
zh_hans: Bearer 授权

source: Bearer token
zh_hans: Bearer 令牌

source: blocked
zh_hans: 已阻塞

source: Blocked
zh_hans: 已阻塞

source: Blocker: %@
zh_hans: 阻塞原因：%@

source: Branch, commit, PR, CI, and review controls stay out of this rail.
zh_hans: 本栏不提供分支、提交、PR、CI 和审查操作。

source: Browse granted MCP resources, prompts, tasks, and calls
zh_hans: 浏览已授权的 MCP 资源、提示词、任务和调用

source: budget limited
zh_hans: 预算受限

source: Budget Limited
zh_hans: 预算受限

source: Cache Hit
zh_hans: 缓存命中

source: Cache Write
zh_hans: 缓存写入

source: Cached
zh_hans: 缓存

source: Call: %lld ms
zh_hans: 调用：%lld 毫秒

source: Calls
zh_hans: 调用

source: Cancel
zh_hans: 取消

source: Cancel current Cowork task
zh_hans: 取消当前 Cowork 任务

source: Cancel task
zh_hans: 取消任务

source: Cancel Task
zh_hans: 取消任务

source: Cancel Turn
zh_hans: 取消本轮

source: cancelled
zh_hans: 已取消

source: Cancelled
zh_hans: 已取消

source: Cancelling the current Cowork task…
zh_hans: 正在取消当前 Cowork 任务…

source: Cannot remove @%@.
zh_hans: 无法移除 @%@。

source: Catalog %@
zh_hans: 目录 %@

# Catalog %@ · Binding %@
source: Catalog %1$@ · Binding %2$@
zh_hans: 目录 %1$@ · 绑定 %2$@

source: Catalog fingerprint
zh_hans: 目录指纹

source: Catalog revision
zh_hans: 目录修订

source: Changing this stable identity forces a new exact connection generation and invalidates older remembered authority.
zh_hans: 更改此稳定身份会强制创建新的精确连接代，并使旧的已记忆权限失效。

source: chat
zh_hans: 对话

source: Chat
zh_hans: 对话

source: Chat endpoint
zh_hans: 对话端点

source: Check endpoint compatibility
zh_hans: 检查端点兼容性

source: Check endpoint or model
zh_hans: 检查端点或模型

source: Check local files
zh_hans: 检查本地文件

source: Check the API key source, provider access, selected model, and endpoint before retrying.
zh_hans: 重试前，请检查 API 密钥来源、提供商访问权限、所选模型和端点。

source: Check the provider message, endpoint, selected model, and request shape before rerunning.
zh_hans: 重新运行前，请检查提供商消息、端点、所选模型和请求结构。

source: Choose a default inference profile before attaching @%@.
zh_hans: 附加 @%@ 前请选择默认推理配置。

source: Choose a default inference profile for new agents.
zh_hans: 请选择供新 Agent 使用的默认推理配置。

source: Choose a resolvable default inference profile before creating Cowork.
zh_hans: 创建 Cowork 前，请选择可解析的默认推理配置。

source: Choose a resolvable model for the next @%@ message before sending.
zh_hans: 发送前，请为下一条 @%@ 消息选择可解析的模型。

source: Choose a server to inspect its immutable configuration, live catalog, access, activity, and diagnostics.
zh_hans: 选择服务器以查看其不可变配置、实时目录、访问权限、活动和诊断。

source: Choose Cowork Workspace
zh_hans: 选择 Cowork 工作区

source: Choose Project Folder
zh_hans: 选择项目文件夹

source: Choose Project Workspace
zh_hans: 选择项目工作区

source: Choose the exact folder registered for this project.
zh_hans: 请选择为该项目登记的同一个文件夹。

source: Choose the original Code workspace at %@.
zh_hans: 请选择位于 %@ 的原 Code 工作区。

source: Choose the original primary workspace at %@.
zh_hans: 请选择位于 %@ 的原主工作区。

source: Choose where to save a local diagnostic ZIP
zh_hans: 选择本地诊断 ZIP 的保存位置

source: Choose Workspace
zh_hans: 选择工作区

source: Choose…
zh_hans: 选择…

source: Clear
zh_hans: 清除

source: Clear this Goal?
zh_hans: 清除此 Goal？

source: Client ID (optional)
zh_hans: 客户端 ID（可选）

source: Client secret
zh_hans: 客户端密钥

source: Close
zh_hans: 关闭

source: Close sidebar
zh_hans: 关闭侧边栏

source: Code
zh_hans: 代码

source: Code workspace access could not be read safely: %@
zh_hans: 无法安全读取 Code 工作区访问权限：%@

source: codex-compat provides the conservative client surface. standard-extended enables the full negotiated roots, sampling, elicitation, subscription, completion, and task client features when their real host services are installed.
zh_hans: codex-compat 提供保守的客户端能力面。安装真实宿主服务后，standard-extended 可启用完整协商的 roots、采样、征询、订阅、补全和任务客户端能力。

source: Collapsed
zh_hans: 已收起

source: Commit, branch, PR, CI, and review workflows are deferred.
zh_hans: 提交、分支、PR、CI 和审查工作流暂未开放。

source: Compatibility env_vars
zh_hans: 兼容 env_vars

source: Complete launch closure
zh_hans: 完整启动闭包

source: completed
zh_hans: 已完成

source: Completed
zh_hans: 已完成

source: Completions
zh_hans: 补全

source: Config: %@
zh_hans: 配置：%@

source: Configuration
zh_hans: 配置

source: Configure the exact redirect, proxy, network-origin, and credential policy.
zh_hans: 配置精确的重定向、代理、网络源和凭据策略。

source: Configure transcription_model before using voice input.
zh_hans: 请先配置 transcription_model，再使用语音输入。

source: Conflicts
zh_hans: 冲突

source: Connect
zh_hans: 连接

source: Connected servers have not published initialize instructions for this Agent.
zh_hans: 已连接的服务器尚未为此 Agent 发布初始化指令。

source: Connection
zh_hans: 连接

source: Connection generation
zh_hans: 连接代次

source: Constraints
zh_hans: 约束

source: Context
zh_hans: 上下文

source: Continue in Browser
zh_hans: 在浏览器中继续

source: coordinator
zh_hans: 协调者

source: Copy message
zh_hans: 复制消息

source: Could not add project: %@
zh_hans: 无法添加项目：%@

source: Could not attach @%@.
zh_hans: 无法附加 @%@。

source: Could not export diagnostic logs: %@
zh_hans: 无法导出诊断日志：%@

source: Could not import configuration: %@
zh_hans: 无法导入配置：%@

source: Could not open JSON config at %@
zh_hans: 无法打开位于 %@ 的 JSON 配置

source: Could not open JSON config: %@
zh_hans: 无法打开 JSON 配置：%@

source: Could not remove project: %@
zh_hans: 无法移除项目：%@

source: Could not resume chat session: %@
zh_hans: 无法继续对话会话：%@

source: Could not resume Code session: %@
zh_hans: 无法继续 Code 会话：%@

source: Could not resume Cowork session: %@
zh_hans: 无法继续 Cowork 会话：%@

source: Could not save settings: %@
zh_hans: 无法保存设置：%@

source: Could not start chat session: %@
zh_hans: 无法启动对话会话：%@

source: Could not start Code session: %@
zh_hans: 无法启动 Code 会话：%@

source: Could not start Cowork session: %@
zh_hans: 无法启动 Cowork 会话：%@

source: Could not start project conversation: %@
zh_hans: 无法启动项目对话：%@

source: Could not test provider: %@
zh_hans: 无法测试提供商：%@

source: Cowork
zh_hans: 协作

source: Cowork Project
zh_hans: Cowork 项目

source: Cowork session could not start: %@
zh_hans: 无法启动 Cowork 会话：%@

source: Cowork session is not ready.
zh_hans: Cowork 会话尚未就绪。

source: Create a privacy-redacted ZIP containing app and session structure, provider and network errors, performance and hang data, and recent Translatis crash reports. Message contents, API keys, configuration files, workspace files, and browser data are excluded. Nothing is uploaded.
zh_hans: 生成经过隐私脱敏的 ZIP，包含 App 与会话结构、提供商和网络错误、性能与卡顿数据，以及近期 Translatis 崩溃报告。消息内容、API 密钥、配置文件、工作区文件和浏览器数据不会包含，也不会上传任何内容。

source: ctx %@/%@
zh_hans: 上下文 %@/%@

source: current
zh_hans: 当前

source: Current launch is forced to %@. This picker is saved immediately for the next launch without an override, so a rescued session can remain in safe mode.
zh_hans: 当前启动已强制使用 %@。此选择会立即保存，并在下次没有启动覆盖时生效，因此恢复后的会话仍可保持安全模式。

source: Current launch is forced to %@. This picker is saved immediately for the next launch without an override; Cancel only discards provider edits.
zh_hans: 当前启动已强制使用 %@。此选择会立即保存，并在下次没有启动覆盖时生效；“取消”只会放弃提供商编辑。

source: Current launch override: %@. Picker stores the next unforced launch mode.
zh_hans: 当前启动覆盖：%@。选择器会保存下一次未强制指定的启动模式。

source: current model
zh_hans: 当前模型

source: Current policy revision: %@
zh_hans: 当前策略修订：%@

source: Current task
zh_hans: 当前任务

source: Currently published for
zh_hans: 当前发布给

source: Declare the complete launch closure explicitly: exactly one executable plus every interpreter, script, package entrypoint, lockfile, and helper. Translatis does not infer files from imported arguments.
zh_hans: 请显式声明完整的启动闭包：必须且只能有一个可执行文件，并包含所有解释器、脚本、包入口点、锁定文件和辅助程序。Translatis 不会根据导入的参数推断文件。

source: Decline
zh_hans: 拒绝

source: Decline Call
zh_hans: 拒绝调用

source: Default approval
zh_hans: 默认审批

source: Default authority
zh_hans: 默认权限

source: Default inference profile (new agents)
zh_hans: 默认推理配置（新 Agent）

source: Default permission
zh_hans: 默认权限

source: Delete
zh_hans: 删除

source: Delete MCP Server?
zh_hans: 删除 MCP 服务器？

source: Delete Model
zh_hans: 删除模型

source: Delete provider
zh_hans: 删除提供商

source: Delete Provider
zh_hans: 删除提供商

source: Delete Session?
zh_hans: 删除会话？

source: Delete…
zh_hans: 删除…

source: Deny
zh_hans: 拒绝

source: Deny, one exact name per line
zh_hans: 拒绝列表，每行一个精确名称

source: Destination host
zh_hans: 目标主机

source: Detach
zh_hans: 解除挂载

source: Detach MCP Server?
zh_hans: 解除挂载 MCP 服务器？

source: Detaching revokes the attachment and all of its Agent grants. The session EventLog remains the audit record.
zh_hans: 解除挂载会撤销该挂载及其所有 Agent 授权。会话 EventLog 仍保留为审计记录。

source: Details
zh_hans: 详细信息

source: Development only. Plain HTTP is accepted only for this exact loopback endpoint; OAuth, redirects, proxies, and non-loopback hosts remain blocked.
zh_hans: 仅限开发使用。明文 HTTP 只对这个精确回环端点开放；OAuth、重定向、代理和非回环主机仍会被阻止。

source: Diagnostic logs were exported as %@ with %lld collection warnings recorded in manifest.json.
zh_hans: 诊断日志已导出为 %@；%lld 项采集警告已记录在 manifest.json 中。

source: Diagnostic logs were exported as %@.
zh_hans: 诊断日志已导出为 %@。

source: Diagnostics
zh_hans: 诊断

source: Direct
zh_hans: 直连

source: Disable
zh_hans: 停用

source: Disabled
zh_hans: 已停用

source: Disconnect
zh_hans: 断开连接

source: Display name
zh_hans: 显示名称

source: Doctor
zh_hans: 诊断检查

source: Done
zh_hans: 完成

source: Duplicate
zh_hans: 复制

source: Durable MCP tool calls for this session will appear here.
zh_hans: 此会话的持久 MCP 工具调用会显示在这里。

source: Duration
zh_hans: 耗时

source: Duration: %lld ms
zh_hans: 耗时：%lld 毫秒

source: Each override is bound to one exact remote tool name. Duplicate or empty names fail closed when the draft is tested.
zh_hans: 每项覆盖都绑定到一个精确的远程工具名称。重复或空名称会在测试草稿时按失败关闭处理。

source: Edit
zh_hans: 编辑

source: Edit Attachment Policy…
zh_hans: 编辑挂载策略…

source: Edit Goal
zh_hans: 编辑 Goal

source: Edit Grant…
zh_hans: 编辑授权…

source: Edit MCP Server
zh_hans: 编辑 MCP 服务器

source: Edit the durable objective and its requirements. Enter one success criterion or constraint per line. Leaving token budget empty means no Goal budget. A paused Goal remains paused.
zh_hans: 编辑持久化目标及其要求。每行输入一项成功标准或约束。Token 预算留空表示不设置 Goal 预算。已暂停的 Goal 会保持暂停。

source: Editing is locked until Test & Save succeeds or you cancel this prepared transaction.
zh_hans: 在“测试并保存”成功或你取消此已准备事务之前，编辑将保持锁定。

source: Editor section
zh_hans: 编辑区域

source: Effective connection authority
zh_hans: 有效连接权限

source: Effective grant
zh_hans: 有效授权

source: Enable
zh_hans: 启用

source: Enable OAuth
zh_hans: 启用 OAuth

source: Enabled
zh_hans: 已启用

source: Endpoint
zh_hans: 端点

source: Enter a goal after /goal.
zh_hans: 请在 /goal 后输入目标。

source: Enter a message before sending.
zh_hans: 发送前请输入消息。

source: Enter a message.
zh_hans: 请输入消息。

source: Enter an agent name.
zh_hans: 请输入 Agent 名称。

source: Enter API key
zh_hans: 输入 API 密钥

source: Enter credentials as Keychain-backed bearer, header, or OAuth references; never paste them into ordinary configuration values.
zh_hans: 将凭据配置为钥匙串支持的 Bearer、请求头或 OAuth 引用；切勿将其粘贴到普通配置值中。

source: env %@
zh_hans: 环境变量 %@

source: environment
zh_hans: 环境变量

source: Environment
zh_hans: 环境

source: Environment identity
zh_hans: 环境身份

source: Environment name
zh_hans: 环境变量名

source: Environment value
zh_hans: 环境值

source: error
zh_hans: 错误

source: Error
zh_hans: 错误

source: Error Information
zh_hans: 错误信息

source: Exact absolute executable path
zh_hans: 精确的可执行文件绝对路径

source: Exact absolute path
zh_hans: 精确绝对路径

source: Exact HTTPS origins, one per line; leave empty to deny network
zh_hans: 精确 HTTPS 源，每行一个；留空表示禁止网络
